#题目：企业发放的奖金根据利润提成。
# 利润(I)低于或等于10万元时，奖金可提10%；
# 利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
# 20万到40万之间时，高于20万元的部分，可提成5%；
# 40万到60万之间时高于40万元的部分，可提成3%；
# 60万到100万之间时，高于60万元的部分，可提成1.5%，
# 高于100万元时，超过100万元的部分按1%提成，
# 从键盘输入当月利润I，求应发放奖金总数？

#程序分析：请利用数轴来分界，定位。注意定义时需把奖金定义成长整型。

def test2():
    i = int(input('请输入净利润：'))
    rate = [0.1,0.75,0.05,0.03,0.015,0.01]
    r1=100000*rate[0]
    r2=(200000-100000)*rate[1]
    r3=(400000-200000)*rate[2]
    r4=(600000-400000)*rate[3]
    r5=(1000000-600000)*rate[4]

    r = 0
    if i<=100000:
        r+=i*rate[0]
    if 100000<i<=200000:
        r+= r1+(i-100000)*rate[1]
    if 200000<i<=400000:
        r+= r1+r2+(i-200000)*rate[2]
    if 400000<i<=600000:
        r+= r1+r2+r3+(i-400000)*rate[3]
    if 600000<i<=1000000:
        r+= r1+r2+r3+r4+(i-600000)*rate[4]
    if 1000000<i:
        r+= r1+r2+r3+r4+r5+(i-1000000)*rate[5]


    print(r)


#只能从大开始比较
def test():
    i = int(input('净利润:'))
    arr = [1000000, 600000, 400000, 200000, 100000, 0]
    rat = [0.01, 0.015, 0.03, 0.05, 0.075, 0.1]
    r = 0
    for idx in range(0, 6):
        if i > arr[idx]:
            r += (i - arr[idx]) * rat[idx]
            print((i - arr[idx]) * rat[idx])
            i = arr[idx]
    print(r)

test2()